; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared2 - mode
	infrared1 - mode
	thermograph0 - mode
	Star0 - direction
	Star2 - direction
	GroundStation7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	GroundStation11 - direction
	GroundStation13 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Star12 - direction
	GroundStation3 - direction
	Star14 - direction
	Star1 - direction
	GroundStation5 - direction
	Planet15 - direction
	Planet16 - direction
	Planet17 - direction
	Planet18 - direction
	Star19 - direction
	Star20 - direction
	Phenomenon21 - direction
	Phenomenon22 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation13)
	(calibration_target instrument0 GroundStation11)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument2 infrared2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star14)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
)
(:goal (and
	(have_image Planet15 thermograph0)
	(have_image Planet16 infrared2)
	(have_image Planet17 infrared2)
	(have_image Planet18 infrared1)
	(have_image Star19 infrared1)
	(have_image Star20 thermograph0)
	(have_image Phenomenon21 infrared2)
	(have_image Phenomenon22 infrared2)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (turn_to satellite1 phenomenon21 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 phenomenon21)
   goals met: 0 of 8
4. (turn_to satellite0 groundstation6 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 8
5. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 0 of 8
6. (turn_to satellite0 planet18 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet18)
   goals met: 0 of 8
7. (take_image satellite0 planet18 instrument0 infrared1)
   added: (have_image planet18 infrared1)
   goals met: 1 of 8
8. (turn_to satellite0 star19 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star19)
   goals met: 1 of 8
9. (take_image satellite0 star19 instrument0 infrared1)
   added: (have_image star19 infrared1)
   goals met: 2 of 8
10. (turn_to satellite1 star14 phenomenon21)
   deleted: (pointing satellite1 phenomenon21)
   added: (pointing satellite1 star14)
   goals met: 2 of 8
11. (calibrate satellite1 instrument2 star14)
   added: (calibrated instrument2)
   goals met: 2 of 8
12. (turn_to satellite1 phenomenon21 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 phenomenon21)
   goals met: 2 of 8
13. (take_image satellite1 phenomenon21 instrument2 infrared2)
   added: (have_image phenomenon21 infrared2)
   goals met: 3 of 8
14. (turn_to satellite1 phenomenon22 phenomenon21)
   deleted: (pointing satellite1 phenomenon21)
   added: (pointing satellite1 phenomenon22)
   goals met: 3 of 8
15. (take_image satellite1 phenomenon22 instrument2 infrared2)
   added: (have_image phenomenon22 infrared2)
   goals met: 4 of 8
16. (turn_to satellite1 planet15 phenomenon22)
   deleted: (pointing satellite1 phenomenon22)
   added: (pointing satellite1 planet15)
   goals met: 4 of 8
17. (take_image satellite1 planet15 instrument2 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 5 of 8
18. (turn_to satellite1 planet16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet16)
   goals met: 5 of 8
19. (take_image satellite1 planet16 instrument2 infrared2)
   added: (have_image planet16 infrared2)
   goals met: 6 of 8
20. (turn_to satellite1 planet17 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet17)
   goals met: 6 of 8
21. (take_image satellite1 planet17 instrument2 infrared2)
   added: (have_image planet17 infrared2)
   goals met: 7 of 8
22. (turn_to satellite1 star20 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 star20)
   goals met: 7 of 8
23. (take_image satellite1 star20 instrument2 thermograph0)
   added: (have_image star20 thermograph0)
   goals met: 8 of 8
